.emacs.d/customization/config.org
* Settings start here onwards
** Set column width to 80 columns, highlight characters after that limit
#+BEGIN_SRC emacs-lisp
(require 'whitespace)
(setq whitespace-line-column 80) ;; limit line length
(setq whitespace-style '(face lines-tail))
(add-hook 'prog-mode-hook 'whitespace-mode)
(global-whitespace-mode t)
#+END_SRC
** Blank scratch pad and start emacs in text mode by default
#+BEGIN_SRC emacs-lisp
(setq initial-scratch-message "")
;;(setq initial-major-mode 'text-mode)
(setq default-major-mode 'text-mode)
(add-hook 'text-mode-hook 'turn-on-auto-fill)
(setq-default auto-fill-hook 'do-auto-fill)
#+END_SRC
** Always kill current buffer
#+BEGIN_SRC emacs-lisp
(defun kill-curr-buffer ()
(interactive)
(kill-buffer (current-buffer)))
(global-set-key (kbd "C-x k") 'kill-curr-buffer)
#+END_SRC
** Kill all buffers with C-M-super-SPC
#+BEGIN_SRC emacs-lisp
(defun kill-all-buffers()
(interactive)
(mapc 'kill-buffer (buffer-list)))
(global-set-key (kbd "C-M-s-SPC") 'kill-all-buffers)
#+END_SRC
** Kill whole word backwards as well as forewards with C-c ww
#+BEGIN_SRC emacs-lisp
(defun kill-whole-word ()
 (interactive)
 (backward-word)
 (kill-word 1))
(global-set-key (kbd "C-c w w") 'kill-whole-word)
;; subword-mode
(global-subword-mode 1)
#+END_SRC
** Disable hippie-exapnd warnings
#+BEGIN_SRC emacs-lisp
(setq ad-redefinition-action 'accept)
#+END_SRC
** Make typing select and delete/overwrite selected text
#+BEGIN_SRC emacs-lisp
(delete-selection-mode 1)
#+END_SRC
** Turn on highlighting current line and use pretty symbols for words
#+BEGIN_SRC emacs-lisp
(when window-system (global-hl-line-mode t))
;;(when window-system (global-prettify-symbols-mode t))
#+END_SRC
** Stop creating autosave files and don't create lock files
#+BEGIN_SRC emacs-lisp
(setq auto-save-default nil)
(setq create-lockfiles nil)
#+END_SRC
** Inhibit splash screen on startup and don't create backup files
#+BEGIN_SRC emacs-lisp
(setq inhibit-splash-screen t)
(setq make-backup-files nil)
#+END_SRC
** Line numbering utility
#+BEGIN_SRC emacs-lisp
(global-linum-mode t)
#+END_SRC
** Display time in modeline
#+BEGIN_SRC emacs-lisp
(display-time-mode 1)
#+END_SRC
** Auto-complete brackets and quotes
#+BEGIN_SRC emacs-lisp
(setq electric-pair-pairs '(
			    (?\( . ?\))
			    (?\{ . ?\})
			    (?\[ . ?\])
                            (?\" . ?\")
                           ))
(electric-pair-mode t)
#+END_SRC
** No blinking cursor, wrap long lines by arrow
#+BEGIN_SRC emacs-lisp
(global-visual-line-mode 1)
(blink-cursor-mode 0)
#+END_SRC
** Websites and links for this setup
*** https://github.com/makuto/editorPreferences/blob/master/Emacs/emacsConfig.txt
*** https://www.youtube.com/watch?v=HTUE03LnaXA
*** https://www.emacswiki.org/emacs/SmoothScrolling
*** https://www.emacswiki.org/emacs/AutoInsertMode
*** http://ergoemacs.org/emacs/emacs_make_modern.html
*** https://www.gnu.org/software/auctex/manual/reftex.html#Installation
*** https://www.emacswiki.org/emacs/YesOrNoP
*** https://github.com/makuto/editorPreferences/blob/master/Emacs/emacsConfig.txt
*** https://orgmode.org/elpa.html
*** https://www.gnu.org/software/auctex/manual/reftex.html#Installation 
*** http://www.kevindemarco.com/2013/04/24/emacs-auctex-synctex-okular-on-ubuntu-12-04/
